
// Здесь будет представленна реализация класса "Социальная сеть" и всех необходимых методов.
#include "SocNetwork.h"

SocNetwork::SocNetwork()
{

}

SocNetwork::~SocNetwork()
{

}

//Здесь будет реализован функционал добавления группы в соц.сети с использованием
// однонаправленного списка с заголовком.
void SocNetwork::AddGroup(const Group &)
{

}

//Здесь будет реализован функционал удаления группы из соц.сети с использованием
// однонаправленного списка с заголовком.
void SocNetwork::DeleteGroup(const Group &)
{

}